[{"name": "Chicken Tikka Masala", "cooking_time": "2hrs", "calories": "499.1", "servings": "4", "ingredients": "1 1⁄2 lbs boneless skinless chicken , cut in 1 inch cubes\n1 cup plain yogurt\n2 tablespoons lemon juice\n2 teaspoons ground cumin\n2 teaspoons    ground red pepper\n2 teaspoons black pepper\n1 teaspoon cinnamon\n1 teaspoon salt\n1 piece    minced ginger (1-inch long)\n6 bamboo skewers (6-inch)\n1 tablespoon unsalted butter\n2 garlic cloves , minced\n1 jalapeno chile , minced\n2 teaspoons ground coriander\n1 teaspoon ground cumin\n1 teaspoon paprika\n1 teaspoon garam masala (buy in Indian market)\n1⁄2 teaspoon salt\n1 (8   ounce) can tomato sauce\n1 cup    whipping cream\n1⁄4 cup   chopped fresh cilantro\n", "directions": "Soak bamboo skewers in water.\nThread chicken on skewers, and marinate (in the refrigerator) for an hour or so.\nDiscard marinade.\nFor sauce, melt butter on medium heat.\nAdd garlic & jalapeno; cook 1 minute.\nStir in coriander, cumin, paprika, garam masala & salt.\nStir in tomato sauce.\nSimmer 15 minutes.\nStir in cream; simmer to thicken- about 5 minutes.\nGrill or broil chicken, turning occasionally, to cook through- about 8 minutes.\nRemove chicken from skewers; add to sauce.\nSimmer 5 minutes.\nGarnish with cilantro Serve with basmati rice, naan or pita bread.\nNote: You can make your own garam masala. McCormick also makes garam masala; it's available in super markets.\n"}, {"name": "Naan", "cooking_time": "40mins", "calories": "213.1", "servings": "1", "ingredients": "4 cups flour\n1 teaspoon baking powder\n1 teaspoon salt\n2 cups plain low-fat yogurt\n", "directions": "Mix together flour, baking powder and salt.\r\nStir in the yogurt till the dough is too stiff for a spoon, then knead it in the bowl till it holds together well, adding more flour if necessary.\r\nTurn it out on a floured surface and continue kneading for about 5 minutes till the dough feels smooth and elastic.\r\nForm the dough into a ball and put it in an oiled bowl, covered with a towel, to rest for an hour or longer.\r\nTake the dough out and cut it into 10 equal pieces. Form each into a ball and press the balls flat into round discs.\r\nHeat a large frying pan or griddle, either seasoned cast iron or a good non-stick finish.  \r\nHeat your oven to about 500 and have the broiler on (this is how the original recipe states it - I know with my oven it's either 500 degree oven OR the broiler, but you get the idea.\r\nTake 1 piece of dough at a time and roll it out on a floured surface till it is about 8-10 inches across and less than 1/4 inch thick.  \r\nLay it on the hot griddle and cook it over a medium heat for 4-5 minutes (I don't think mine took that long). \r\nIt will puff up in places or all over, and there will be some blackish-brown spots on the bottom.\r\nSlide a spatula under the naan and transfer it to the oven, directly onto the rack, for a minute or two, just till it finishes puffing up into a balloon and begins to color lightly on top.  \r\nRemove naan from the oven and brush it lightly with melted butter if you like.\r\nContinue this way with all the dough, stacking the breads into a napkin-lined basket.  \r\nServe the breads hot, fresh from the oven, or let them cool and wrap them up.\r\nTo reheat, wrap them in aluminum foil, in packets of 4 or 5 breads and put them in a 400 degree oven for 10-15 minutes.\n"}]